MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
/*
MIT License

Copyright (c) 2024 Maximilian Mönikes

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/


#include "TLE9012.h"
#include "TLE9012_Makros.h"

HardwareSerial* hisoUART; //Pointer to the Hardware Serial Driver



//-----------------------------------------------------------------------------
//                         Initilization Functions
//-----------------------------------------------------------------------------

/**
* Constructor for TLE9012 class. Unused for now
*/
TLE9012::TLE9012()  //Constructor
{
  errorcallbacks.adc_error_callback = NULL;
  errorcallbacks.balancing_error_overcurrent_callback = NULL;
  errorcallbacks.balancing_error_undercurrent_callback = NULL;
  errorcallbacks.external_temp_error_callback = NULL;
  errorcallbacks.internal_IC_error_callback = NULL;
  errorcallbacks.internal_temp_error_callback = NULL;
  errorcallbacks.open_load_error_callback = NULL;
  errorcallbacks.overvoltage_callback = NULL;
  errorcallbacks.reg_crc_error_callback = NULL;
  errorcallbacks.undervoltage_callback = NULL;
  errorcallbacks.ps_error_sleep_callback = NULL;
}

/**
* Destructor for TLE9012 class. Unused for now
*/
TLE9012::~TLE9012() //Destructor
{

}
      

/**
* @brief initialization Method
*
* Call this function before making any other calls to library functions. The Hardwareserial port is also initilized here
* @note only Hardware Serial should be used because the response from the TLE9012 comes in at high baudrates
*
* @param serial pointer to a Serial handler class/struct
* @param baudrate Baudrate of the Serialport -> must be between 1Mbit and 2Mbits
* @param rxpin optional parameter to specify RX Pin under some architectures
* @param txpin optional parameter to specify TX Pin under some architectures
*/      
      
void TLE9012::init(HardwareSerial* serial, uint32_t baudrate=1000000,uint8_t rxpin=0,uint8_t txpin=0)//Driver init
{
  hisoUART = serial;
  if((rxpin != 0) && (txpin != 0))
    hisoUART->begin(baudrate,SERIAL_8N1,rxpin,txpin);
  else
    hisoUART->begin(baudrate,SERIAL_8N1);
}

/**
* @brief Wakeup all TLE9012 devices on the Bus
*
* This function sends a wakeup signal across the daisy chain which is forwarded by all TLE9012/9015 devices
*/

void TLE9012::wakeUp()
{

  iso_uart_status_t status;
  status = isoUART_TIMEOUT;

  uint8_t wakeupbuffer[2];
  wakeupbuffer[0] = 0xAA;
  wakeupbuffer[1] = 0xAA;
  wakeupbuffer[2] = 0xAA;


  isoUARTClearRXBUffer();
  hisoUART->write(wakeupbuffer,2);

  uint32_t starttime = millis();
  while((millis()-starttime) < ISOUART_TIMEOUT)
  {
    if(hisoUART->available() > 1)
    {
      status = isoUART_OK;
      break;
    }
  }
}

  //---------------------------------------------------------------------------
  //                       Functions to Configure and Perform Measurements
  //---------------------------------------------------------------------------
  
  
  /**
  * @brief Performs cell voltage measurements for a given Device in the Daisy Chain
  *
  * This function performs cell voltage measurements for all configured cells of a device with a given nodeID.
  * The results are stored in the devices[nodeID-1].cell_voltages[] array. 
  *
  * @param nodeID is the address of the node on the daisy chain
  */
  void TLE9012::readCellVoltages(uint8_t nodeID)
  {

    if(nodeID > N_DEVICES)
    {
      return; //Early return if device number is to high
    }

    uint8_t deviceID = nodeID - 1;

    if(nodeID == 0)
      deviceID = 0;
    else
      deviceID = nodeID-1;
    
    writeRegisterSingle(nodeID, MEAS_CTRL, 0xEE61); //Trigger PCVM, BVM and SCVM with PBOFF
    mcuDelay(5);

    for(uint8_t n = 0; n < devices[deviceID].n_cells; n++)
    {
      (void) readRegisterSingle(nodeID, PCVM_0 + (11-devices[deviceID].n_cells + n), &devices[deviceID].cell_voltages[n]);
    }

    (void) readRegisterSingle(nodeID,BVM,&devices[deviceID].block_voltage);
    (void) readRegisterSingle(nodeID,SCVM_HIGH,&devices[deviceID].scvm_high);
    devices[deviceID].scvm_high &= 0xFFE0; //Remove rolling counter
    (void) readRegisterSingle(nodeID,SCVM_LOW,&devices[deviceID].scvm_low);
    devices[deviceID].scvm_low &= 0xFFE0; //Remove rolling counter
  }

  /**
  * @brief Performs NTC/PTC resistance measurements for a given Device in the Daisy Chain
  *
  * This function performs NTC/PTC resistance measurements for all configured Temperature channels of a device with a given nodeID.
  * The results are stored in the devices[nodeID-1].ntc_resistances[] array
  *
  * @param nodeID is the address of the node on the daisy chain
  */
  void TLE9012::readTemperatures(uint8_t nodeID)
  {
    if(nodeID > N_DEVICES)
    {
      return; //Early return if device number is to high
    }

    uint8_t deviceID = nodeID - 1;

    if(nodeID == 0)
      deviceID = 0;
    else
      deviceID = nodeID-1;

    (void) writeRegisterSingle(nodeID, MEAS_CTRL, 0x0080);
    mcuDelay(5);
    
    devices[deviceID].ntc_results_valid = 0;
    for(uint8_t n = 0; n < devices[deviceID].n_temp_sensors; n++)
    {
      (void) readRegisterSingle(nodeID,EXT_TEMP0+n,&devices[deviceID].ntc_resistances[n]);

