MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
      if((devices[deviceID].ntc_resistances[n]>>13)&0x01)
      {
        devices[deviceID].ntc_results_valid++;
      }
    }

    if(devices[deviceID].ntc_results_valid == 0)
      devices[deviceID].ntc_results_valid = 1;
    else
      devices[deviceID].ntc_results_valid = 0;
    
  }
  
  /**
  * @brief configure number of cells for device with address nodeID
  *
  * This function configures the ADCs in the device with address nodeID to only measure and monitor a given number of cells. If
  * fever than 12 cells are used, the channels next to GND shall be shorted on the TLE9012 Board but cell numbers will still start from
  * 0 to n_cells for all arrays inside of this driver.
  *
  * @param nodeID is the address of the node on the daisy chain
  * @param n_cells is the number of cells that are connected to the TLE9012 (max. 12)
  */
  void TLE9012::setNumberofCells(uint8_t nodeID, uint8_t n_cells)
  {

    if(nodeID > N_DEVICES)
    {
      return; //Early return if device number is to high
    }

    uint8_t deviceID = nodeID - 1;

    if(nodeID == 0)
      deviceID = 0;
    else
      deviceID = nodeID-1;

    devices[deviceID].n_cells = n_cells;

    uint16_t cell_mask = 0;

    for(uint8_t n = 0; n < n_cells; n++)
    {
      cell_mask |= 1<<(11-n);
    }
    
    (void) writeRegisterSingle(nodeID,PART_CONFIG,cell_mask);
    (void) writeRegisterSingle(nodeID,SCVM_CONFIG,cell_mask);
  }

/**
* @brief configure number and configuration of temperature sensors
*
* This function configures the Temperature measurement unit in the device with address nodeID. Note that different
* senorconfig structs can be used for different boards but only one can be used per board. This is no hardware limitation
* but instead a limitation by this driver at the moment
*
* @param nodeID is the address of the node on the daisy chain
* @param n_temp_sensors is the number of temperature sensors that shall be used
* @param sensorconfig ntc_config_t struct that holds nominal resistance and beta value of the NTCs used
*/
  void TLE9012::setTempSensorsConfig(uint8_t nodeID, uint8_t n_temp_sensors, ntc_config_t sensorconfig)
  {

    if(nodeID > N_DEVICES)
    {
      return; //Early return if device number is to high
    }

    uint8_t deviceID = nodeID - 1;

    if(nodeID == 0)
      deviceID = 0;
    else
      deviceID = nodeID-1;

    devices[deviceID].n_temp_sensors = n_temp_sensors;
    devices[deviceID].sensorconfig = sensorconfig;

    uint16_t sens_conf = 0;
    (void) readRegisterSingle(nodeID, TEMP_CONF,&sens_conf);

    if(n_temp_sensors > 5)
      n_temp_sensors = 5;

    sens_conf &= 0x0FFF;
    sens_conf |= n_temp_sensors << 12;

    (void) writeRegisterSingle(nodeID, TEMP_CONF, sens_conf);

    uint16_t avm_sensemask = 0;
    for(uint8_t n = 0; n <n_temp_sensors; n++)
    {
      avm_sensemask |= 1<<(n+3);
    }
    avm_sensemask |= 0x7;

    (void) writeRegisterSingle(nodeID, AVM_CONFIG, avm_sensemask);
  }
 
/**
 * @brief Read the internal chip temperature of internal chiptemperature sensor 1 and 2
 * 
 * Internal chip Temperatures are stored in the devices[] struct only if the temperatures are valid.
 * 
 * @param nodeID is the address of the node on the daisy chain
 */
  void TLE9012::readChipTemperatures(uint8_t nodeID)
  {
    if(nodeID > N_DEVICES)
    {
      return; //Early return if device number is to high
    }

    uint8_t deviceID = nodeID - 1;

    if(nodeID == 0)
      deviceID = 0;
    else
      deviceID = nodeID-1;

    (void) readRegisterSingle(nodeID,INT_TEMP,&devices[deviceID].chiptemperature1);
    (void) readRegisterSingle(nodeID,INT_TEMP_2,&devices[deviceID].chiptemperature2);

    if(((devices[deviceID].chiptemperature1>>13)&0x01) && ((devices[deviceID].chiptemperature2>>13)&0x01))
      devices[deviceID].chiptemperatures_valid = 1;
    else
      devices[deviceID].chiptemperatures_valid = 0;
    
  }

  //---------------------------------------------------------------------------
  //                       Watchdog and Powermode Functions
  //---------------------------------------------------------------------------
  
  
  /**
   * @brief Activate Sleep mode for all devices in the daisy chain
   * 
   * Powers down all devices on the daisy chain
   * 
   */
  void TLE9012::activateSleep()
  {
    (void) writeRegisterBroadcast(OP_MODE,0x0001); //Return is ignored for now
  }

  /**
   * @brief Reset Watchdog Timer to maximum value
   * 
   * Resets the watchdog timer register to 0x7F on all devices in the daisy chain
   * 
   */

  void TLE9012::resetWatchdog()
  {
    (void) writeRegisterBroadcast(WDOG_CNT,0x007F);
  }

  /**
   * @brief Changes the watchdog mode from normal to extended mode
   * 
   * In normal mode the watchdog times out after approximatly 2s which might be undesireable during inital configuration or
   * some other reasons. Therefore the watchdog mode can be set to extended leading to a timeout after approx. 37 hours. Note
   * that it's not recommended to use the extended mode during normal operation
   * 
   * @param nodeID is the address of the device on the daisy chain
   */

  void TLE9012::setExtendedWatchdog(uint8_t nodeID)
  {
    uint16_t op_mode_reg = 0;
    (void) readRegisterSingle(nodeID, OP_MODE, &op_mode_reg);
    op_mode_reg |= 0x0002;
    (void) writeRegisterSingle(nodeID, OP_MODE, op_mode_reg);
  }

  /**
   * @brief Set watchdog to normal operation mode
   * 
   * This function resets the watchdog mode from extended to normal. For a more detailled explanation see setExtendedWatchdog
   * 
   * @param nodeID is the address of the device on the daisy chain
   */

  void TLE9012::clearExtendedWatchdog(uint8_t nodeID)
  {
    uint16_t op_mode_reg = 0;
    (void) readRegisterSingle(nodeID, OP_MODE, &op_mode_reg);
    op_mode_reg &= 0xFFFD;
    (void) writeRegisterSingle(nodeID, OP_MODE, op_mode_reg);
  }

 
  //---------------------------------------------------------------------------
  //                       Miscellaneous Functions 
  //---------------------------------------------------------------------------
  
/**
 * @brief Read IC and Manufacturing ID
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @return uint16_t id -> IC and Manufacturer Version ID. Should return 0xC140 according to user manual
 */

  uint16_t TLE9012::readICVersionandManufacturerID(uint8_t nodeID)
  {
    uint16_t id = 0;
    (void) readRegisterSingle(nodeID, ICVID, &id);
    return id;
  }

/**
 * @brief Assign new nodeID to a device in the daisychain
 * 
 *  After reset all devices on the daisy chain start with nodeID 0 and will not forward messages until a non zero node ID is
 *  assigned. During enumeration this function can be used to assign new nodeIDs(device addresses) using subsequent calls with
 *  oldID = 0 and newID = 1..N. The finalNode parameter has to be set for the last element in the daisy chain to ensure that
 *  a reply frame is send in response to a broadcast command
 * 
 * @param oldID is the current nodeID of the device
 * @param newID is the new nodeID of the device
 * @param finalNode is 0 if the device is not the final element in the daisy chain and 1 if the device is the final element
 */

  void TLE9012::setNodeID(uint8_t oldID, uint8_t newID, uint8_t finalNode)
  {
    uint16_t cfg;
    (void) readRegisterSingle(oldID,CONFIG,&cfg);
    cfg &= 0x07C0;
    cfg |= newID & 0x3F;
    cfg |= finalNode<<11;
    (void) writeRegisterSingle(oldID,CONFIG,cfg);
  }

/**
 * @brief Write a value to the mailbox register
 * 
 *  The mailbox register is a voltaile storage register which can be used to verify read and write access working correctly
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param value is the value that shall be written into the mailbox register
 */

  void TLE9012::writeMailboxRegister(uint8_t nodeID, uint16_t value)
  {
    (void) writeRegisterSingle(nodeID,MAILBOX,value);
  }

/**
 * @brief Reads the current value in the mailbox register
 * 
 *  Read Wrapper for the mailbox register to ensure read access is working correctly
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @return uint16_t is the value currently stored in the mailbox register
 */

