MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
  uint16_t TLE9012::readMailboxRegister(uint8_t nodeID)
  {
    uint16_t id = 0;
    (void) readRegisterSingle(nodeID, MAILBOX, &id);
    return id;
  }

  //---------------------------------------------------------------------------
  //                       Error Checking and Handling 
  //---------------------------------------------------------------------------

/**
 * @brief Check if the Diagnosis resistor measurement is inside the expected range. This can be used in error handlers to
 * further analyse the root cause of errors
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @return uint8_t returns 1 if diagnosis resistor is inside of the temperature range, 2 if no valid result is detected and 0 if
 * the diagnosis resistance is outside of the expected range
 */
  uint8_t TLE9012::checkDiagnoseResistor(uint8_t nodeID)
  {
    //Not implemented yet
    uint16_t reg_diag_r = 0;
    (void) readRegisterSingle(nodeID, EXT_TEMP_R_DIAG, &reg_diag_r);
    if((reg_diag_r>>13)&0x01)
      return 2;
    uint16_t result = reg_diag_r & 0x03FF;
    uint8_t intc = (reg_diag_r >> 10) &0x03;

    switch (intc)
    {
    case 3:
      if((reg_diag_r > 218) | (reg_diag_r < 107))
      {
        return 1;
      }
      else
      {
        return 0;
      }
      break;

    case 2:
      if((reg_diag_r > 358) | (reg_diag_r < 193))
      {
        return 1;
      }
      else
      {
        return 0;
      }
      break;

    case 1:
      if((reg_diag_r > 603) | (reg_diag_r < 326))
      {
        return 1;
      }
      else
      {
        return 0;
      }
      break;

    case 0:
      if((reg_diag_r > 950) | (reg_diag_r < 595))
      {
        return 1;
      }
      else
      {
        return 0;
      }
      break;
    
    default:
      break;
    }

  }


  /**
   * @brief Attach an error handler function that is called if something goes wrong
   * 
   * This function allows you to register your own errorhandler that gets called if the checkErrors function is detecting
   * an error. The available types of errors are defined in the tle9012_error_t enum and cover all error that are described in
   * the General Diagnosis register. All errorhandler functions take a nodeID as well as a uint16_t additional parameter as arguments. 
   * The additional arguments usually include the associated errorflag registers. If no associate register exists, a filler value is
   * used. 
   * 
   * @param errortype is the type of error that the handler is for 
   * @param errorhandler is a function pointer to the errorhandler
   */

  void TLE9012::attachErrorHandler(tle9012_error_t errortype, void (*errorhandler)(uint8_t, uint16_t))
  {
    switch(errortype)
    {
      case OVERVOLTAGE_ERROR:
        errorcallbacks.overvoltage_callback = errorhandler;
        break;
      case UNDERVOLTAGE_ERROR:
        errorcallbacks.undervoltage_callback = errorhandler;
        break;
      case ADC_ERROR:
        errorcallbacks.adc_error_callback = errorhandler;
        break;
      case INTERNAL_IC_ERROR:
        errorcallbacks.internal_IC_error_callback = errorhandler;
        break;
      case OPEN_LOAD_ERROR:
        errorcallbacks.open_load_error_callback = errorhandler;
        break;
      case REG_CRC_ERROR:
        errorcallbacks.reg_crc_error_callback = errorhandler;
        break;
      case EXTERNAL_TEMP_ERROR:
        errorcallbacks.external_temp_error_callback = errorhandler;
        break;
      case INTERNAL_TEMP_ERROR:
        errorcallbacks.internal_temp_error_callback = errorhandler;
        break;
      case BALANCING_UNDERCURRENT_ERROR:
        errorcallbacks.balancing_error_undercurrent_callback = errorhandler;
        break;
      case BALANCING_OVERCURRENT_ERROR:
        errorcallbacks.balancing_error_overcurrent_callback = errorhandler;
        break;
      default:
        break;
    }
  }

/**
 * @brief Check the GEN_DIAG register for errors and call the appropriate errorhandler function if one was defined via the
 * attachErrorHandler function
 * 
 * @param nodeID is the address of the node on the daisy chain
 */
  void TLE9012::checkErrors(uint8_t nodeID)
  {
    uint16_t gen_diag = 0;
    (void) readRegisterSingle(nodeID,GEN_DIAG,&gen_diag);
    
    if(gen_diag & 0x8000)
    {
      uint16_t balancing_oc_flags = 0;
      (void) readRegisterSingle(nodeID,BAL_DIAG_OC,&balancing_oc_flags);
      if(errorcallbacks.balancing_error_overcurrent_callback != NULL)
        errorcallbacks.balancing_error_overcurrent_callback(nodeID,balancing_oc_flags);
    }

    if(gen_diag & 0x4000)
    {
      uint16_t balancing_uc_flags = 0;
      (void) readRegisterSingle(nodeID,BAL_DIAG_UC,&balancing_uc_flags);
      if(errorcallbacks.balancing_error_undercurrent_callback != NULL)
        errorcallbacks.balancing_error_undercurrent_callback(nodeID,balancing_uc_flags);
    }

    if(gen_diag & 0x2000)
    {
      uint16_t cell_ov_diag = 0;
      (void) readRegisterSingle(nodeID,CELL_OV,&cell_ov_diag);
      if(errorcallbacks.overvoltage_callback != NULL)
        errorcallbacks.overvoltage_callback(nodeID,cell_ov_diag);
    }

    if(gen_diag & 0x1000)
    {
      uint16_t cell_uv_diag = 0;
      (void) readRegisterSingle(nodeID,CELL_UV,&cell_uv_diag);
      if(errorcallbacks.undervoltage_callback != NULL)
        errorcallbacks.undervoltage_callback(nodeID,cell_uv_diag);
    }

    if(gen_diag & 0x0800)
    {
      uint16_t overtemp = 0;
      (void) readRegisterSingle(nodeID,INT_TEMP,&overtemp);
      if(errorcallbacks.internal_temp_error_callback != NULL)
        errorcallbacks.internal_temp_error_callback(nodeID,overtemp);
    }

    if(gen_diag & 0x0400)
    {
      uint16_t ext_temp_err = 0;
      (void) readRegisterSingle(nodeID,EXT_TEMP_DIAG,&ext_temp_err);
      if(errorcallbacks.external_temp_error_callback != NULL)
        errorcallbacks.external_temp_error_callback(nodeID,ext_temp_err);
    }

    if(gen_diag & 0x0200)
    {
      uint16_t reg_crc = 0;
      (void) readRegisterSingle(nodeID,REG_CRC_ERR,&reg_crc);
      if(errorcallbacks.reg_crc_error_callback != NULL)
        errorcallbacks.reg_crc_error_callback(nodeID,reg_crc);
    }

    if(gen_diag & 0x0100)
    {
      uint16_t ic_error = 0;
      if(errorcallbacks.internal_IC_error_callback != NULL)
        errorcallbacks.internal_IC_error_callback(nodeID,0x0000);
    }

    if(gen_diag & 0x0080)
    {
      uint16_t open_load = 0;
      (void) readRegisterSingle(nodeID,DIAG_OL,&open_load);
      if(errorcallbacks.open_load_error_callback != NULL)
        errorcallbacks.open_load_error_callback(nodeID,open_load);
    }

    if(gen_diag & 0x0040)
    {
      if(errorcallbacks.adc_error_callback != NULL)
        errorcallbacks.adc_error_callback(nodeID,0x0000);
    }

    if(gen_diag & 0x0020)
    {
      if(errorcallbacks.ps_error_sleep_callback != NULL)
        errorcallbacks.ps_error_sleep_callback(nodeID,0x0000);
    }
  }

/**
 * @brief Reset the GEN_DIAG register
 * 
 * Clears all errorflags stored in the GEN_DIAG register
 * 
 * @param nodeID is the address of the node on the daisy chain
 */

