MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
  void TLE9012::resetErrors(uint8_t nodeID)
  {
    (void) writeRegisterSingle(nodeID,GEN_DIAG,0x0000);
  }

/**
 * @brief Configure the Fault Mask register influencing the EMM-Signal and Error-Pin
 * 
 * This function can be used to mask errors that shall not trigger an Emergency Mode (EMM) Signal or influence the Error Pin
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param err_mask defines what type of errors shall be masked out 
 * @return * void 
 */
  void TLE9012::configFaultMasks(uint8_t nodeID, err_emm_error_mask_t err_mask)
  {
    uint16_t errormask = 0;
    errormask |= err_mask.balancing_overcurrent_error<<15;
    errormask |= err_mask.balancing_undercurrent_error<<14;
    errormask |= err_mask.overvoltage_error << 13;
    errormask |= err_mask.undervoltage_error << 12;
    errormask |= err_mask.internal_temperature_error << 11;
    errormask |= err_mask.external_termperature_error << 10;
    errormask |= err_mask.reg_crc_err << 9;
    errormask |= err_mask.int_ic_err << 8;
    errormask |= err_mask.open_load_error << 7;
    errormask |= err_mask.adc_error << 6;
    errormask |= err_mask.err_pin << 5;

    (void) writeRegisterSingle(nodeID,FAULT_MASK,errormask);
  }

  //---------------------------------------------------------------------------
  //                       Round Robin Functions 
  //---------------------------------------------------------------------------


/**
 * @brief Set parameters for the Round Robin Error detection and self check
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param rr_sleep_interval How often is the round robing triggered in rr_sleep_LSB
 * @param rr_temp_measurement_interval External temperature measurement can be skipped every n round robin cycles
 * @param n_errors Number of consecutive errors before error pin and GEN_DIAG register is triggered
 */

  void TLE9012::setRoundRobinErrorHandling(uint8_t nodeID, uint16_t rr_sleep_interval, uint8_t rr_temp_measurement_interval, uint8_t n_errors)
  {
    rr_sleep_interval = (rr_sleep_interval&0x03FF)<<6;
    rr_temp_measurement_interval = (rr_temp_measurement_interval&0x7)<<3;
    n_errors = n_errors & 0x07;

    (void) writeRegisterSingle(nodeID, RR_ERR_CNT, rr_sleep_interval | (uint16_t) rr_temp_measurement_interval | (uint16_t) n_errors);
    
  }

/**
 * @brief Configure Errormasks and Round Robin Timing
 * 
 * This function configures the round robin timing as well as the round robin sync function and errormasks. The Round Robin counter
 * defines how often a Round Robin cycle is performed. In addition the RR_SYNC function can be activated which triggers a round robin cycle
 * each time a write access to the watchdog counter is performed. 
 * 
 * In addition an errormask of type rr_error_mask_t can be passed as an argument which allows to enable which type of errors are
 * included in the round robin measurement cycle
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param rr_counter sets how often a Round Robin is performed
 * @param rr_sync if 1, the sync mode is activated 
 * @param errormask errormask defining what errors shall be monitored by the round robin. Setting flags to 1 enables the monitoring
 */

  void TLE9012::setRoundRobinConfig(uint8_t nodeID, uint8_t rr_counter, uint8_t rr_sync, rr_error_mask_t errormask)
  {
    uint16_t rr_cfg = (uint16_t) rr_counter & 0x7F;
    rr_cfg |= (rr_sync & 0x1) << 7;
    rr_cfg |= errormask.adc_error << 8;
    rr_cfg |= errormask.open_load_error << 9;
    rr_cfg |= errormask.external_termperature_error << 10;
    rr_cfg |= errormask.internal_temperature_error << 11;
    rr_cfg |= errormask.undervoltage_error << 12;
    rr_cfg |= errormask.overvoltage_error << 13;
    rr_cfg |= errormask.balancing_undercurrent_error << 14;
    rr_cfg |= errormask.balancing_overcurrent_error << 15;

    (void) writeRegisterSingle(nodeID, RR_CONFIG, rr_cfg);
  }

  //---------------------------------------------------------------------------
  //                       Balancing Functions 
  //---------------------------------------------------------------------------

/**
 * @brief 
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param pwm_duty_cycle 
 */
  void TLE9012::setBalancingPWM(uint8_t nodeID, tle9012_balancing_pwm_t pwm_duty_cycle)
  {
    (void) writeRegisterSingle(nodeID,BAL_PWM,pwm_duty_cycle);
  }

/**
 * @brief Set the balancing time for a cell
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param cell cell between 1 and 12 
 * @param value value of the cell counter between 0 and 0x1F (7.5min steps)
 */
  void TLE9012::setBalancingCounter(uint8_t nodeID, uint8_t cell, uint8_t value)
  {
    cell = cell-1;
    uint8_t regblock = cell/3;
    cell = (cell%3)*5;
    uint16_t val = (value & 0x1F)<<cell;

    switch(regblock)
    {
      case 0:
        (void) writeRegisterSingle(nodeID,BAL_CNT_0,val);
        break;
      case 1:
        (void) writeRegisterSingle(nodeID,BAL_CNT_1,val);
        break;
      case 2:
        (void) writeRegisterSingle(nodeID,BAL_CNT_2,val);
        break;
      case 3:
        (void) writeRegisterSingle(nodeID,BAL_CNT_3,val);
        break;
    }
  }

/**
 * @brief Start Balancing on channels selected by bitmask
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param balancing_mask bitmask defining on what channels balancing is activated
 */
  void TLE9012::startBalancing(uint8_t nodeID, uint16_t balancing_mask)
  {
    (void) writeRegisterSingle(nodeID,BAL_SETTINGS,balancing_mask & 0x0FFF);
  }

  //---------------------------------------------------------------------------
  //                       Error Threshold Settings
  //---------------------------------------------------------------------------

/**
 * @brief Set Overvoltage Threshold for Error detection
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param fault_threshold Overvoltage Threshold in 5V/1024 * fault_threshold
 */
  void TLE9012::setOvervoltageThreshold(uint8_t nodeID, uint16_t fault_threshold)
  {
    uint16_t ol_ov_reg = 0;
    (void) readRegisterSingle(nodeID,OL_OV_THR,&ol_ov_reg);
    ol_ov_reg &= 0xFC00;
    ol_ov_reg |= fault_threshold & 0x03FF;
    (void) writeRegisterSingle(nodeID,OL_OV_THR,ol_ov_reg);
  }

/**
 * @brief Set Undervoltage Threshold for Error detection
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param fault_threshold Undervoltage Threshold in 5V/1024 * fault_threshold
 */
  void TLE9012::setUndervoltageThreshold(uint8_t nodeID, uint16_t fault_threshold)
  {
    uint16_t ol_uv_reg = 0;
    (void) readRegisterSingle(nodeID,OL_UV_THR,&ol_uv_reg);
    ol_uv_reg &= 0xFC00;
    ol_uv_reg |= fault_threshold & 0x03FF;
    (void) writeRegisterSingle(nodeID,OL_UV_THR,ol_uv_reg);
  }

/**
 * @brief Set maximum voltage drop for Open Load detection
 * 
 * Expected Voltage drop is approx. 15mA * Rf
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param open_load_threshold threshold in 19.5mV steps
 */
  void TLE9012::setOpenLoadThresholdMax(uint8_t nodeID, uint8_t open_load_threshold)
  {
    uint16_t ol_thr_max = 0;
    (void) readRegisterSingle(nodeID,OL_OV_THR,&ol_thr_max);
    ol_thr_max &= 0x03FF;
    ol_thr_max |= ((uint16_t) open_load_threshold & 0x3F) << 10;
    (void) writeRegisterSingle(nodeID,OL_OV_THR,ol_thr_max);
  }

/**
 * @brief Set minimum voltage drop for Open Load detection
 * 
 * Expected Voltage drop is approx. 15mA * Rf
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param open_load_threshold threshold in 19.5mV steps
 */
  void TLE9012::setOpenLoadThresholdMin(uint8_t nodeID, uint8_t open_load_threshold)
  {
    uint16_t ol_thr_min = 0;
    (void) readRegisterSingle(nodeID,OL_UV_THR,&ol_thr_min);
    ol_thr_min &= 0x03FF;
    ol_thr_min |= ((uint16_t) open_load_threshold & 0x3F)<<10;
    (void) writeRegisterSingle(nodeID,OL_UV_THR,ol_thr_min);
  }

/**
 * @brief Set threshold for external temperature detection
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param external_overtemperature_threshold threshold for external overtemperature warning
 */
  void TLE9012::setExternalTemperatureThreshold(uint8_t nodeID, uint16_t external_overtemperature_threshold)
  {
  
