MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
  }

/**
 * @brief Set threshold for internal overtemperature
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param internal_overtemperature_threshold internal DIE overtemperature limit 
 */
  void TLE9012::setInternalTemperatureThreshold(uint8_t nodeID, uint16_t internal_overtemperature_threshold)
  {
    (void) writeRegisterSingle(nodeID, INT_OT_WARN_CONF, (internal_overtemperature_threshold & 0x3FF));
  }

/**
 * @brief Set Balancing current thresholds
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param overcurrent_threshold maximum voltage drop over balancing resistor in 19.5mV steps 
 * @param undercurrent_threshold minimum voltage drop over balancing resistor in 19.5mV steps
 */
  void TLE9012::setBalancingCurrentThreshold(uint8_t nodeID, uint8_t overcurrent_threshold, uint8_t undercurrent_threshold)
  {
    uint16_t bal_thr = (((uint16_t) undercurrent_threshold) << 8) | overcurrent_threshold;
    (void) writeRegisterSingle(nodeID, BAL_CURR_THR, bal_thr);
  }


      
  //---------------------------------------------------------------------------
  //                       Low Level isoUART Access Functions
  //---------------------------------------------------------------------------

/**
 * @brief isoUART function to read a single register from a single node on the daisy chain
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param regaddress address of register for this operation
 * @param result result of the read operation is stored in this variable
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::readRegisterSingle(uint8_t nodeID, uint16_t regaddress, uint16_t* result)
{
  iso_uart_status_t status;
  uint8_t response_buffer[9];
  
  status = isoUART_TIMEOUT;

  isoUARTClearRXBUffer();
  isoUARTReadRequest(nodeID, regaddress);

  uint32_t starttime = millis();
  while((millis()-starttime) < ISOUART_TIMEOUT)
  {
    if(hisoUART->available() > 8)
    {
      hisoUART->readBytes(response_buffer,9);
      status = isoUART_OK;
      break;
    }
  }

  //Check if Timeout occured
  if(status != isoUART_OK)
  {
    status = isoUART_TIMEOUT;
    return status;
  }

  #ifdef SOFT_MSB_FIRST
  msb_first_converter(&(response_buffer[4]),5);
  #endif
  uint8_t crc = crc8(&response_buffer[4],5);

  *result = (((uint16_t) response_buffer[6])<<8) | ((uint16_t) response_buffer[7]);

  if(crc != response_buffer[8]);
    //status = isoUART_CRC_ERROR;

  return status;
}

/**
 * @brief isoUART function to write a value to a single register on a single node in the daisy chain
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param regaddress address of register for this operation
 * @param databuffer value that shall be written to the register
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::writeRegisterSingle(uint8_t nodeID, uint16_t regaddress, uint16_t databuffer) //Write data to a single register
{

  iso_uart_status_t status;
  uint8_t response_buffer[7];
  
  status = isoUART_TIMEOUT;

  isoUARTClearRXBUffer();
  isoUARTWriteRequest(nodeID, regaddress, databuffer);
  
  uint32_t starttime = millis();
  while((millis()-starttime) < ISOUART_TIMEOUT)
  {
    if(hisoUART->available() > 6)
    {
      hisoUART->readBytes(response_buffer,7);
      status = isoUART_OK;
      break;
    }
  }

  //Check if Timeout occured
  if(status != isoUART_OK)
  {
    status = isoUART_TIMEOUT;
    return status;
  }  

  //Check if reply frame was received correctly
  #ifdef SOFT_MSB_FIRST
  msb_first_converter(&response_buffer[6],1);
  #endif
  if(!crc3(response_buffer[6]))
  {
    status = isoUART_CRC_ERROR;
    return status;
  }

  return status;
}

/**
 * @brief isoUART function to read the value of a register in broadcast mode from every node on the daisy chain
 * 
 * @param regaddress address of register for this operation
 * @param result pointer to an array storing the result -> arraysize must be equal or larger than number of devices in the daisy chain
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::readRegisterBroadcast(uint16_t regaddress, uint16_t* result) //Read a broadcast to all devices in the daisy chain
{
  iso_uart_status_t status;
  uint8_t response_buffer[N_DEVICES*5+4];
  
  status = isoUART_TIMEOUT;

  isoUARTClearRXBUffer();
  isoUARTReadRequest(BROADCAST_ID, regaddress);

  uint32_t starttime = millis();
  while((millis()-starttime) < ISOUART_TIMEOUT)
  {
    if(hisoUART->available() > (3+(5*N_DEVICES)))
    {
      hisoUART->readBytes(response_buffer,4+5*N_DEVICES);
      status = isoUART_OK;
      break;
    }
  }

  //Check if Timeout occured
  if(status != isoUART_OK)
  {
    status = isoUART_TIMEOUT;
    return status;
  }
  
  #ifdef SOFT_MSB_FIRST
  msb_first_converter(&response_buffer[4],N_DEVICES*5);
  #endif

  for(uint8_t n = 0; n < N_DEVICES; n++)
  {
    uint8_t crc = crc8(&response_buffer[4+(n*N_DEVICES)],5);
    result[n] = (((uint16_t) response_buffer[6+(n*N_DEVICES)])<<8) | ((uint16_t) response_buffer[7+(n*N_DEVICES)]);
    if(crc != 0)
      status = isoUART_CRC_ERROR;
  }
  

  return status;
}

/**
 * @brief isoUART function to write a register in all nodes in the daisy chain
 * 
 * @param regaddress address of register for this operation
 * @param databuffer value that shall be written to the selected register
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::writeRegisterBroadcast(uint16_t regaddress, uint16_t databuffer) //Write a register as broadcast from all devices in the chain
{

  iso_uart_status_t status;
  uint8_t response_buffer[7];
  
  status = isoUART_TIMEOUT;

  isoUARTClearRXBUffer();
  isoUARTWriteRequest(BROADCAST_ID, regaddress, databuffer);
  uint32_t starttime = millis();
  while((millis()-starttime) < ISOUART_TIMEOUT)
  {
    if(hisoUART->available() > 6)
    {
      hisoUART->readBytes(response_buffer,7);
      status = isoUART_OK;
      break;
    }
  }

  //Check if Timeout occured
  if(status != isoUART_OK)
  {
    status = isoUART_TIMEOUT;
    return status;
  }

  //Check if reply frame was received correctly
  #ifdef SOFT_MSB_FIRST
  msb_first_converter(&response_buffer[6],1);
  #endif

