MaxMax-embedded/TLE9012_Arduino_Lib/TLE9012.cpp
  if(!crc3(response_buffer[6]))
  {
    status = isoUART_CRC_ERROR;
    return status;
  }

  return status;
}

/**
 * @brief Configure the multiread function on all devices
 * 
 * @note currently not supported
 * 
 * @param cfg multiread configuration containing information about what registers shall be reed with a multiread command
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::configureMultiread(multiread_cfg_t cfg)  //Write a multiread configuration to all devices in the daisy chain
{
  return isoUART_OK; //Multiread is unsuported for the moment
}

/**
 * @brief isoUART function to perform a multiread operation
 * 
 * @note currently not supported
 * 
 * @param databuffer databuffer for the multiread command. The databuffer must have a large enough size to prevent bufferoverflow
 * @return iso_uart_status_t returns status of the bustransaction
 */
iso_uart_status_t TLE9012::multiRead(multread_result_t* databuffer) //Multiread command from all devices in the chain
{
  return isoUART_OK; //Multiread is unsuported for the moment
}

  //---------------------------------------------------------------------------
  //                       Platform dependent Functions
  //---------------------------------------------------------------------------

/**
 * @brief Check the crc3 of reply frames of the isoUART protocol
 * 
 * @param replyframe 8bit replyframe including the CRC3
 * @return uint8_t returns 1 if CRC is correct and 0 if CRC is incorrect
 */
uint8_t TLE9012::crc3(uint8_t replyframe)
{
    uint8_t polynomial = 0xB0;
    uint8_t crc = replyframe;
    
    for(uint8_t n = 0; n < 5; n++)
    {
        if(crc & 0x80)
        {
            crc = crc^polynomial;
            crc = crc << 1;
        }
        else
            crc = crc << 1;
    }
    
    if(crc == 0)
        return 1;
    else
        return 0;
}

/**
 * @brief Calculate the crc8 for dataframes in the isoUART protocol
 * 
 * @param buffer buffer containing the data for the crc calculation
 * @param len length of the buffer
 * @return uint8_t crc8 value
 */
uint8_t TLE9012::crc8(uint8_t* buffer, uint16_t len)
{
  const uint8_t polynomial = 0x1D;
  uint8_t crc = 0xFF;

  for(uint16_t i = 0; i < len; i++)
  {
    crc ^= buffer[i];

    for(uint8_t j = 0;  j < 8; j++)
    {
      if((crc & 0x80) != 0)
      {
        crc = (crc<<1)^polynomial;
      }
      else
        crc = crc << 1;
    }
  }

  return crc^0xFF;
}

/**
 * @brief flip bits in an byte to allow for msb first uart frames over arduinos lsb first serial driver
 * 
 * @param data databuffer with bytes that shall be converted from lsb first to msb first
 * @param len length of the buffer
 * @return uint8_t always returns 0
 */
uint8_t TLE9012::msb_first_converter(uint8_t* data, uint16_t len)
{
  for(uint16_t n = 0;  n < len; n++)
  {
    data[n] = ((data[n] & 0xF0) >> 4) | ((data[n] & 0x0F) << 4);
    data[n] = ((data[n] & 0xCC) >> 2) | ((data[n] & 0x33) << 2);
    data[n] = ((data[n] & 0xAA) >> 1) | ((data[n] & 0x55) << 1);
  }
  return 0;
}

/**
 * @brief starts a write request on the isoUART bus
 * 
 * While the writeRegisterSingle function seems to do the same, the isoUARTWriteRequest function
 * provides a wrapper to allow for an easy adaption to different Frameworks with different Serial
 * style implementations
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param regaddress address of register for this operation
 * @param data data that shall be written to the register
 */
void TLE9012::isoUARTWriteRequest(uint8_t nodeID, uint8_t regaddress, uint16_t data)
{
  uint8_t writebuffer[6];
  writebuffer[0] = 0x1E; //Syncframe
  writebuffer[1] = nodeID |  WRITECOMMAND;
  writebuffer[2] = regaddress;
  writebuffer[3] = (uint8_t)(data >> 8);
  writebuffer[4] = (uint8_t)(data & 0xFF);
  writebuffer[5] = 0x00;

  writebuffer[5] = crc8(writebuffer,5);
  #ifdef SOFT_MSB_FIRST
  msb_first_converter(writebuffer, 6);
  #endif

  hisoUART->write(writebuffer,6);
}

/**
 * @brief request data from a device using the isoUART protocol
 * 
 * Note that this function does not handle the received data but only sends a request for data.
 * Handeling of the received packet is in the responsibility of the caller function
 * 
 * @param nodeID is the address of the node on the daisy chain
 * @param regaddress 
 */
void TLE9012::isoUARTReadRequest(uint8_t nodeID, uint8_t regaddress)
{
  uint8_t writebuffer[4];
  writebuffer[0] = 0x1E;
  writebuffer[1] = nodeID;
  writebuffer[2] = regaddress;
  writebuffer[3] = 0x00;

  writebuffer[3] = crc8(writebuffer,3);
  #ifdef SOFT_MSB_FIRST
  msb_first_converter(writebuffer, 4);
  #endif
  hisoUART->write(writebuffer,4);
}

/**
 * @brief Clear remaining RX Buffer in case something went wrong during isoUART read or write
 * 
 */
void TLE9012::isoUARTClearRXBUffer()
{
  while(hisoUART->available())
    uint8_t null = hisoUART->read();
}

/**
 * @brief Delay in milliseconds
 * 
 * Wrapper function to enable easier port to different Architectures/Frameworks
 * 
 * @param delay_ms Minimum delay time in milliseconds
 */
void TLE9012::mcuDelay(uint32_t delay_ms)
{
  delay(delay_ms);
}